nooblong/misc/stm32/hardware/PWM.cpp
#include "stm32f10x.h" // Device header

/**
 * 函    数：PWM初始化
 * 参    数：无
 * 返 回 值：无
 */
void PWM_Init(void)
{
	/*开启时钟*/
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);  // 开启TIM2的时钟
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE); // 开启GPIOA的时钟

	/*GPIO重映射*/
	//	RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);			//开启AFIO的时钟，重映射必须先开启AFIO的时钟
	//	GPIO_PinRemapConfig(GPIO_PartialRemap1_TIM2, ENABLE);			//将TIM2的引脚部分重映射，具体的映射方案需查看参考手册
	//	GPIO_PinRemapConfig(GPIO_Remap_SWJ_JTAGDisable, ENABLE);		//将JTAG引脚失能，作为普通GPIO引脚使用

	/*GPIO初始化*/
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2 | GPIO_Pin_0;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_InitStructure); // 将PA0引脚初始化为复用推挽输出
										   // 受外设控制的引脚，均需要配置为复用模式

	/*配置时钟源*/
	TIM_InternalClockConfig(TIM2); // 选择TIM2为内部时钟，若不调用此函数，TIM默认也为内部时钟

	/*时基单元初始化*/
	// 100000hz, 50%, 分辨率10%, 72000000Hz 
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInitStructure;				// 定义结构体变量
	TIM_TimeBaseInitStructure.TIM_ClockDivision = TIM_CKD_DIV1;		// 时钟分频，选择不分频，此参数用于配置滤波器时钟，不影响时基单元功能
	TIM_TimeBaseInitStructure.TIM_CounterMode = TIM_CounterMode_Up; // 计数器模式，选择向上计数
	TIM_TimeBaseInitStructure.TIM_Period = 10 - 1;					// 计数周期，即ARR的值 9
	TIM_TimeBaseInitStructure.TIM_Prescaler = 72 - 1;				// 预分频器，即PSC的值 10 0000
	TIM_TimeBaseInitStructure.TIM_RepetitionCounter = 0;			// 重复计数器，高级定时器才会用到
	TIM_TimeBaseInit(TIM2, &TIM_TimeBaseInitStructure);				// 将结构体变量交给TIM_TimeBaseInit，配置TIM2的时基单元

	/*输出比较初始化*/
	TIM_OCInitTypeDef TIM_OCInitStructure;	// 定义结构体变量
	TIM_OCStructInit(&TIM_OCInitStructure); // 结构体初始化，若结构体没有完整赋值
											// 则最好执行此函数，给结构体所有成员都赋一个默认值
											// 避免结构体初值不确定的问题
	TIM_OCInitStructure.TIM_OCMode = TIM_OCMode_PWM1;			  // 输出比较模式，选择PWM模式1
	TIM_OCInitStructure.TIM_OCPolarity = TIM_OCPolarity_High;	  // 输出极性，选择为高，若选择极性为低，则输出高低电平取反
	TIM_OCInitStructure.TIM_OutputState = TIM_OutputState_Enable; // 输出使能
	TIM_OCInitStructure.TIM_Pulse = 0;							  // 初始的CCR值
	TIM_OC1Init(TIM2, &TIM_OCInitStructure);					  // 将结构体变量交给TIM_OC1Init，配置TIM2的输出比较通道1
	TIM_OC2Init(TIM2, &TIM_OCInitStructure);					  // 将结构体变量交给TIM_OC2Init，配置TIM2的输出比较通道2
	TIM_OC3Init(TIM2, &TIM_OCInitStructure);					  // 将结构体变量交给TIM_OC3Init，配置TIM2的输出比较通道3

	/*TIM使能*/
	TIM_Cmd(TIM2, ENABLE); // 使能TIM2，定时器开始运行
}

/**
 * 函    数：PWM设置CCR
 * 参    数：Compare 要写入的CCR的值，范围：0~1000000
 * 返 回 值：无
 * 注意事项：CCR和ARR共同决定占空比，此函数仅设置CCR的值，并不直接是占空比
 *           占空比Duty = CCR / (ARR + 1)
 */
void PWM_SetCompare1(int Compare)
{
	TIM_SetCompare1(TIM2, Compare); // 设置CCR1的值
}
void PWM_SetCompare2(int Compare)
{
	TIM_SetCompare2(TIM2, Compare); // 设置CCR1的值
}
void PWM_SetCompare3(int Compare)
{
	TIM_SetCompare3(TIM2, Compare); // 设置CCR1的值
}

void PWM_SetPrescaler(int Prescaler)
{
	TIM_PrescalerConfig(TIM2, Prescaler, TIM_PSCReloadMode_Immediate);
}
